**Лабораторная работа №1.**

Выбор темы №1 (Учет товаров на складах и их потребности на торговых точках), создание логической модели и ER-диаграммы в DB Designer.



**Лабораторная работа №2.**

Создание базы данных на pgAdmin, добавление необходимых таблиц и записей в них, SELECT-запрос, соединяющий 3 таблицы с помощью JOINю

**Лабораторная работа №3.**

Создание трех представлений: prod_strg_view, requests_store1_view, requests_view.


**Лабораторная работа №4.**

Генерация 100000 строк с помощью Python и их добавление в таблицу Product, сравнение времени выполнения запроса до создания индекса по полю price (65 мс) и после его создания (46 мс).
